import math

def area(r):
    '''
    Возвращает площадь круга.
        Параметр:
            r (float,int): радиус окружности.
        Константа:
            math.pi: значение числа pi из библиотеки math.
        Возвращаемое значение:
            math.pi * r * r (float,int): значение площади круга радиуса r.
    '''
    return math.pi * r * r

def perimeter(r):
    '''
    Возвращает длинну окружности.
        Параметр:
            r (float,int): радиус окружности.
        Константа:
            math.pi: значение числа pi из библиотеки math.
        Возвращаемое значение:
            2 * math.pi * r (float,int): значение периметра круга радиуса r.
    '''
    return 2 * math.pi * r
