def area(a, b):
    '''
    Возвращает площадь прямоугольника.
        Параметр:
            a (float,int): сторона прямоугольника.
            b (float,int): сторона прямоугольника, отличная по длинне от a.
        Возвращаемое значение:
            a * b (float,int): значение площади прямоугольника с параметрами a, b.
    '''
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника.
        Параметр:
            a (float,int): сторона прямоугольника.
            b (float,int): сторона прямоугольника, отличная по длинне от a.
        Возвращаемое значение:
            2 * (a + b) (float,int): значение периметра прямоугольника с параметрами a, b.
    '''
    return 2*(a + b)
