def area(a, h):
    '''
    Возвращает площадь треугольника.
        Параметры:
            a (float,int): сторона треугольника, к которой проведена высота h.
            h (float,int): высота треугольника, проведенная к стороне a.
        Возвращаемое значение:
            a * h / 2 (float,int): значение площади треугольника с параметрами a и h.
    '''
    return a * h / 2

def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника.
        Параметры:
            a (float,int): первая сторона треугольника
            b (float,int): вторая сторона треугольника
            c (float,int): третья сторона треугольника
        Возвращаемое значение:
            a + b + c (float,int): значение периметр треугольника с параметрами a, b и с.
    '''
    return a + b + c
